<a href="https://colab.research.google.com/github/sakamoto-hands-on/DataScience_MatsuoLab_HandsOn/blob/master/DataWrangling_with_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandasを使ったデータ加工処理

### [松尾研究室のデータサイエンティスト講座 公開ページ](https://weblab.t.u-tokyo.ac.jp/en/gci_contents/)を参考に、手を動かしながら学ぶ

## 階層型インデックス

<練習問題 1>

次のデータに対して、Kyotoの列だけ抜き出してみましょう。

In [1]:
# 以下のモジュールを使うので、あらかじめ読み込んでおいてください
import numpy as np
import numpy.random as random
import scipy as sp
import pandas as pd
from pandas import Series, DataFrame

# 可視化モジュール
import matplotlib.pyplot as plt
import matplotlib as mpl
import seaborn as sns
%matplotlib inline

# 小数第３まで表示
%precision 3

'%.3f'

In [2]:
hier_data_frame1 = DataFrame(np.arange(12).reshape((3,4))
                           ,index = [['c','d','d'],[1,2,1]]
                           ,columns = [['Kyoto','Nagoya','Hokkaido','Kyoto']
                                      ,['Yellow','Yellow','Red','Blue']]
                           )

hier_data_frame1.index.names =['key1','key2']
hier_data_frame1.columns.names =['city','color']
hier_data_frame1

city       Kyoto Nagoya Hokkaido Kyoto
color     Yellow Yellow      Red  Blue
key1 key2
c    1         0      1        2     3
d    2         4      5        6     7
     1         8      9       10    11

In [3]:
hier_data_frame1['Kyoto']

color      Yellow  Blue
key1 key2
c    1          0     3
d    2          4     7
     1          8    11



---

<練習問題 2>

練習問題1のデータに対して、cityをまとめて列同士の平均値を出してください。

In [4]:
hier_data_frame1.groupby(['Kyoto', 'Nagoya', 'Hokkaido']).mean()

ValueError: ignored

ネットで調べてみたところ、京都の列が二つあることでこのエラーがでているようです。
さらに色の列名がつけられていて、一つはYellowでもう一つはBlue。これはどういうデータを想定しているのか、ちょっと分かりかねたので、スキップすることにしました。



---

<練習問題 3>

練習問題1のデータに対して、key2ごとに行の合計値を算出してみましょう。

In [8]:
hier_data_frame1.sum(level=1)

city   Kyoto Nagoya Hokkaido Kyoto
color Yellow Yellow      Red  Blue
key2
1          8     10       12    14
2          4      5        6     7



---

## データのマージ

<練習問題 1>

下記の2つのデータテーブルに対して、内部結合してみましょう。

In [9]:
# データ4の準備
attri_data4 = {'ID':['0','1','2','3','4','6','8','11','12','13']
        ,'city':['Tokyo','Osaka','Kyoto','Hokkaido','Tokyo','Tokyo','Osaka','Kyoto','Hokkaido','Tokyo']
        ,'birth_year':[1990,1989,1992,1997,1982,1991,1988,1990,1995,1981]
        ,'name':['Hiroshi','Akiko','Yuki','Satoru','Steeve','Mituru','Aoi','Tarou','Suguru','Mitsuo']}
attri_data_frame4 = DataFrame(attri_data4)
attri_data_frame4

   ID      city  birth_year     name
0   0     Tokyo        1990  Hiroshi
1   1     Osaka        1989    Akiko
2   2     Kyoto        1992     Yuki
3   3  Hokkaido        1997   Satoru
4   4     Tokyo        1982   Steeve
5   6     Tokyo        1991   Mituru
6   8     Osaka        1988      Aoi
7  11     Kyoto        1990    Tarou
8  12  Hokkaido        1995   Suguru
9  13     Tokyo        1981   Mitsuo

In [10]:
# データ5の準備
attri_data5 = {'ID':['0','1','3','6','8']
        ,'math':[20,30,50,70,90]
        ,'English':[30,50,50,70,20]
        ,'sex':['M','F','F','M','M']
        ,'index_num':[0,1,2,3,4]}
attri_data_frame5 = DataFrame(attri_data5)
attri_data_frame5

  ID  math  English sex  index_num
0  0    20       30   M          0
1  1    30       50   F          1
2  3    50       50   F          2
3  6    70       70   M          3
4  8    90       20   M          4

In [11]:
pd.merge(attri_data_frame4,attri_data_frame5,on='ID')

  ID      city  birth_year     name  math  English sex  index_num
0  0     Tokyo        1990  Hiroshi    20       30   M          0
1  1     Osaka        1989    Akiko    30       50   F          1
2  3  Hokkaido        1997   Satoru    50       50   F          2
3  6     Tokyo        1991   Mituru    70       70   M          3
4  8     Osaka        1988      Aoi    90       20   M          4



---

<練習問題 2>

attri_data_frame4をベースにattri_data_frame5のテーブルを外部結合してみましょう。

In [12]:
pd.merge(attri_data_frame4,attri_data_frame5,how='outer')

   ID      city  birth_year     name  math  English  sex  index_num
0   0     Tokyo        1990  Hiroshi  20.0     30.0    M        0.0
1   1     Osaka        1989    Akiko  30.0     50.0    F        1.0
2   2     Kyoto        1992     Yuki   NaN      NaN  NaN        NaN
3   3  Hokkaido        1997   Satoru  50.0     50.0    F        2.0
4   4     Tokyo        1982   Steeve   NaN      NaN  NaN        NaN
5   6     Tokyo        1991   Mituru  70.0     70.0    M        3.0
6   8     Osaka        1988      Aoi  90.0     20.0    M        4.0
7  11     Kyoto        1990    Tarou   NaN      NaN  NaN        NaN
8  12  Hokkaido        1995   Suguru   NaN      NaN  NaN        NaN
9  13     Tokyo        1981   Mitsuo   NaN      NaN  NaN        NaN



---

<練習問題 3>

attri_data_frame4に対して、以下のデータを縦結合してみましょう。

In [0]:
# データの準備
attri_data6 = {'ID':['70','80','90','120','150']
        ,'city':['Chiba','Kanagawa','Tokyo','Fukuoka','Okinawa']
        ,'birth_year':[1980,1999,1995,1994,1994]
        ,'name':['Suguru','Kouichi','Satochi','Yukie','Akari']}
attri_data_frame6 = DataFrame(attri_data6)

In [14]:
Concat = pd.concat([attri_data_frame4,attri_data_frame6])
Concat

    ID      city  birth_year     name
0    0     Tokyo        1990  Hiroshi
1    1     Osaka        1989    Akiko
2    2     Kyoto        1992     Yuki
3    3  Hokkaido        1997   Satoru
4    4     Tokyo        1982   Steeve
5    6     Tokyo        1991   Mituru
6    8     Osaka        1988      Aoi
7   11     Kyoto        1990    Tarou
8   12  Hokkaido        1995   Suguru
9   13     Tokyo        1981   Mitsuo
0   70     Chiba        1980   Suguru
1   80  Kanagawa        1999  Kouichi
2   90     Tokyo        1995  Satochi
3  120   Fukuoka        1994    Yukie
4  150   Okinawa        1994    Akari



---

## データの操作と変換

<練習問題 1>

以前の章で使用した「student-mat.csv」のデータを使います。ageを2倍にしたカラムを追加してみましょう。

In [0]:
# 以下のモジュールを使うので、あらかじめ読み込んでおいてください
import numpy as np
import numpy.random as random
import scipy as sp
import pandas as pd
from pandas import Series, DataFrame

# 可視化モジュール
import matplotlib.pyplot as plt
import matplotlib as mpl
import seaborn as sns
%matplotlib inline

# 小数第３まで表示
%precision 3

# webからデータを取得したり、zipファイルを扱うためのモジュール
import requests, zipfile
from io import StringIO
import io

In [0]:
# データがあるurl の指定
zip_file_url = "http://archive.ics.uci.edu/ml/machine-learning-databases/00356/student.zip"

# データをurlから取得する
r = requests.get(zip_file_url, stream=True)

# zipfileを読み込み展開する
z = zipfile.ZipFile(io.BytesIO(r.content))
z.extractall()

In [0]:
student_data_math = pd.read_csv("student-mat.csv", sep=";")
student_data_math.head()

In [18]:
student_data_math_DoubleAge = student_data_math['age'].map(lambda x:int(x) * 2)
student_data_math_DoubleAge

0      36
1      34
2      30
3      30
4      32
       ..
390    40
391    34
392    42
393    36
394    38
Name: age, Length: 395, dtype: int64



---

<練習問題 2>

上記と同じデータで、「absences」のカラムについて、以下の3つのビンに分けてそれぞれの人数を数えてみましょう。なお、cutのオプション設定で、デフォルトは右側が閉区間になっていますが、今回は0が入るためのright=Falseを追加してください。

In [0]:
#　分割の粒度
absences_bins = [0,1,5,100]

In [20]:
pd.cut(student_data_math.absences,absences_bins, right=False)

0      [5, 100)
1        [1, 5)
2      [5, 100)
3        [1, 5)
4        [1, 5)
         ...
390    [5, 100)
391      [1, 5)
392      [1, 5)
393      [0, 1)
394    [5, 100)
Name: absences, Length: 395, dtype: category
Categories (3, interval[int64]): [[0, 1) < [1, 5) < [5, 100)]



---

<練習問題 3>

上記と同じデータで、「absences」のカラムについて、qcutを用いて3つのビンに分けてみましょう。

In [21]:
pd.value_counts(pd.qcut(student_data_math.absences,3))

(-0.001, 2.0]    183
(6.0, 75.0]      115
(2.0, 6.0]        97
Name: absences, dtype: int64



---

## データの集約とグループ演算

<練習問題 1>

先ほど使用した「student-mat.csv」を使って「student-mat.csv」を使って、pandasの集計処理してみましょう。まずは、schoolを軸にして、G1の平均点をそれぞれ求めてみましょう。

In [36]:
student_data_math.groupby("school")[("G1","G2","G3")].mean()

               G1         G2         G3
school
GP      10.939828  10.782235  10.489971
MS      10.673913  10.195652   9.847826



---

<練習問題 2>

次は、schoolと性別を軸にして、G1,G2,G3の平均点をそれぞれ求めてみましょう。

In [37]:
student_data_math.groupby(["school","sex"])[("G1","G2","G3")].mean()

                   G1         G2         G3
school sex
GP     F    10.579235  10.398907   9.972678
       M    11.337349  11.204819  11.060241
MS     F    10.920000  10.320000   9.920000
       M    10.380952  10.047619   9.761905



---

<練習問題 3>

次は、schoolと性別を軸にして、G1,G2,G3の最大値、最小値をまとめて算出してみましょう。

In [38]:
functions = ['min','max']
student_data_math.groupby(["school","sex"])[("G1","G2","G3")].agg(functions)

            G1      G2      G3
           min max min max min max
school sex
GP     F     4  18   0  18   0  19
       M     3  19   0  19   0  20
MS     F     6  19   5  18   0  19
       M     6  15   5  16   0  16



---

# 欠損データと異常値の取り扱いの基礎

## 欠損データの扱い方

<練習問題 1>

以下のデータに対して、1列でもNaNがある場合は削除し、その結果を表示してください。

In [42]:
# データの準備
import numpy as np
from numpy import nan as NA
import pandas as pd


sample_data_frame2 = pd.DataFrame(np.random.rand(15,6))

# NAにする
sample_data_frame2.iloc[2,0] = NA
sample_data_frame2.iloc[5:8,2] = NA
sample_data_frame2.iloc[7:9,3] = NA
sample_data_frame2.iloc[10,5] = NA


sample_data_frame2.dropna()

           0         1         2         3         4         5
0   0.342754  0.942487  0.942639  0.242672  0.184331  0.150460
1   0.591888  0.332031  0.889600  0.410955  0.465420  0.576582
3   0.574885  0.494346  0.965483  0.126113  0.955866  0.745723
4   0.759183  0.581324  0.526032  0.906269  0.629506  0.719709
9   0.093970  0.560863  0.595692  0.009892  0.219868  0.026847
11  0.724883  0.806882  0.432191  0.676989  0.983871  0.367395
12  0.834132  0.950073  0.118419  0.191660  0.994802  0.481784
13  0.244582  0.942288  0.893191  0.826535  0.108556  0.587200
14  0.876645  0.100968  0.790718  0.983319  0.454467  0.005871



---

<練習問題 2>

上記で準備したデータに対して、NaNを0で埋めてください。

In [43]:
sample_data_frame2.fillna(0)

           0         1         2         3         4         5
0   0.342754  0.942487  0.942639  0.242672  0.184331  0.150460
1   0.591888  0.332031  0.889600  0.410955  0.465420  0.576582
2   0.000000  0.132168  0.601493  0.953448  0.322781  0.820267
3   0.574885  0.494346  0.965483  0.126113  0.955866  0.745723
4   0.759183  0.581324  0.526032  0.906269  0.629506  0.719709
5   0.045896  0.299225  0.000000  0.849600  0.412251  0.601501
6   0.381779  0.045255  0.000000  0.080963  0.972324  0.997884
7   0.129026  0.910951  0.000000  0.000000  0.220207  0.035120
8   0.604430  0.659499  0.135319  0.000000  0.628985  0.512630
9   0.093970  0.560863  0.595692  0.009892  0.219868  0.026847
10  0.496606  0.535195  0.682087  0.526764  0.807611  0.000000
11  0.724883  0.806882  0.432191  0.676989  0.983871  0.367395
12  0.834132  0.950073  0.118419  0.191660  0.994802  0.481784
13  0.244582  0.942288  0.893191  0.826535  0.108556  0.587200
14  0.876645  0.100968  0.790718  0.983319  0.454467  0.005871



---

<練習問題 3>

上記で準備したデータに対して、NaNをそれぞれの列の平均値で埋めてください。

In [44]:
sample_data_frame2.fillna(sample_data_frame2.mean())

           0         1         2         3         4         5
0   0.342754  0.942487  0.942639  0.242672  0.184331  0.150460
1   0.591888  0.332031  0.889600  0.410955  0.465420  0.576582
2   0.478619  0.132168  0.601493  0.953448  0.322781  0.820267
3   0.574885  0.494346  0.965483  0.126113  0.955866  0.745723
4   0.759183  0.581324  0.526032  0.906269  0.629506  0.719709
5   0.045896  0.299225  0.631072  0.849600  0.412251  0.601501
6   0.381779  0.045255  0.631072  0.080963  0.972324  0.997884
7   0.129026  0.910951  0.631072  0.521937  0.220207  0.035120
8   0.604430  0.659499  0.135319  0.521937  0.628985  0.512630
9   0.093970  0.560863  0.595692  0.009892  0.219868  0.026847
10  0.496606  0.535195  0.682087  0.526764  0.807611  0.473498
11  0.724883  0.806882  0.432191  0.676989  0.983871  0.367395
12  0.834132  0.950073  0.118419  0.191660  0.994802  0.481784
13  0.244582  0.942288  0.893191  0.826535  0.108556  0.587200
14  0.876645  0.100968  0.790718  0.983319  0.454467  0.005871



---